{
  "FocalLoss": false,
  "WeightedBCELoss": false,
  "_name_or_path": "ckiplab/albert-tiny-chinese",
  "architectures": [
    "BertVanillaTextClsForTransformers"
  ],
  "attention_probs_dropout_prob": 0.0,
  "bce_pos_weight": [
    1,
    1
  ],
  "bos_token_id": 101,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 102,
  "freeze_bert": false,
  "gap_size": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 1248,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 4,
  "num_memory_blocks": 0,
  "output_hidden_states": true,
  "pad_token_id": 0,
  "pooling": "mean",
  "position_embedding_type": "absolute",
  "pre_seq_len": 7,
  "prefix_hidden_size": 512,
  "prefix_projection": "mlp",
  "problem_type": "single_label_classification",
  "strategy": "NO",
  "tokenizer_class": "BertTokenizerFast",
  "torch_dtype": "float32",
  "transformers_version": "4.32.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "use_gradient_checkpointing": true,
  "vocab_size": 21128
}
